{
  "_name_or_path": "tmp",
  "architectures": [
    "CustomLlamaForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "modeling_custom_llama.CustomLlamaConfig",
    "AutoModel": "modeling_custom_llama.CustomLlamaModel",
    "AutoModelForCausalLM": "modeling_custom_llama.CustomLlamaForMLM"
  },
  "mrl_dims":[32,64,128,768],
  "mrl_layers":[4,8,12],
  "cur_dim":768,
  "bi_attn": true,
  "attention_bias": false,
  "attention_dropout": 0.1,
  "input_dropout": 0.1,
  "hidden_dropout":0.0,
  "bos_token_id": 0,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "max_position_embeddings": 512,
  "model_type": "llama",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "num_key_value_heads": 12,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.40.0",
  "use_cache": true,
  "vocab_size": 250002
}